kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_7_1/ESP32-S3-Station-V_7_7_1.ino
  // สถานะที่พยาบาลอ่านแล้วรู้ว่าต้องทำอะไรต่อ — ไม่ต้องตีความตัวเลขเอง
  const iv::DetectorStatus &ds = det();
  String sensorKey = String(sensorStateWord()) + ":" + String(ds.snrX10 / 5) + ":" +
                     String(ds.motion ? 1 : 0);
  if (sensorKey != cacheP3b) {
    cacheP3b = sensorKey;
    textAt(padTo(String(sensorStateWord()), 14), 14, 118, 2, sensorStateColor(), UI_CARD);
    textAt(padTo("SNR " + String(ds.snrX10 / 10) + "." + String(ds.snrX10 % 10) +
                 "x   STEADY " + String(ds.confidencePct) + "%", 22),
           14, 144, 1, UI_DIM, UI_CARD);
    textAt(padTo(ds.motion ? "MOVING - bag swinging"
                           : ("DROP " + String(ds.learnedAmp) + " / " +
                              String(ds.learnedWidthMs) + " ms"), 22),
           14, 160, 1, ds.motion ? COLOR_YELLOW : UI_DIM, UI_CARD);
  }

  float bv = readStationBattery();
  String devKey = String(currentStationId) + ":" + String(safeDropFactor(dropFactor)) + ":" + String((int)(bv * 10)) + ":" + String(totalDrops);
  if (devKey != cacheP3c) {
    cacheP3c = devKey;
    char bed[12];
    snprintf(bed, sizeof(bed), "BED %02d", currentStationId);
    textAt(padTo(String(bed) + "  DF" + String(safeDropFactor(dropFactor)), 12), 14, 212, 2, COLOR_WHITE, UI_CARD);
    textAt(padTo("DROPS " + String(totalDrops), 22), 14, 236, 1, UI_DIM, UI_CARD);
    String pw = (bv > 0.5f) ? ("BATT " + String(bv, 2) + " V") : String("POWER USB");
    textAt(padTo("FW " APP_VERSION "   " + pw, 22), 14, 252, 1, UI_DIM, UI_CARD);
  }
}

// ============================================================================
// หน้า 4: TREND — กราฟแท่งอัตราไหลย้อนหลัง 30 นาที (แท่งละ 1 นาที)
// ============================================================================
#define CHART_X    12
#define CHART_BARW 5
#define CHART_TOP  56
#define CHART_BOT  196

float trendValueAt(int i) {
  int idx = (trendHead + i) % TREND_BARS;
  return trendHas[idx] ? trendBin[idx] : 0.0f;
}

bool trendValidAt(int i) {
  int idx = (trendHead + i) % TREND_BARS;
  return trendHas[idx];
}

float niceScale(float v) {
  float s = 20.0f;
  while (s < v && s < 400.0f) s += (s < 100.0f) ? 10.0f : (s < 200.0f ? 20.0f : 50.0f);
  return s;
}

void drawTrendChart() {
  const int chartH = CHART_BOT - CHART_TOP;
  const int chartW = TREND_BARS * CHART_BARW;

  float maxV = (targetRateHr > 0) ? targetRateHr : 1.0f;
  for (int i = 1; i < TREND_BARS; i++) if (trendValueAt(i) > maxV) maxV = trendValueAt(i);
  if (trendLive > maxV) maxV = trendLive;
  trendScale = niceScale(maxV * 1.1f);

  tft.fillRect(CHART_X - 3, CHART_TOP - 12, chartW + 6, chartH + 26, THEME_BG);
  for (int g = 1; g <= 3; g++) {
    int gy = CHART_BOT - (chartH * g) / 4;
    for (int x = CHART_X; x < CHART_X + chartW; x += 4) tft.drawPixel(x, gy, UI_CARD);
  }

  for (int i = 0; i < TREND_BARS; i++) {
    bool live = (i == TREND_BARS - 1);
    float v = live ? trendLive : trendValueAt(i + 1);
    bool has = live ? true : trendValidAt(i + 1);
    int x = CHART_X + i * CHART_BARW;
    int h = (int)((v / trendScale) * chartH);
    if (h > chartH) h = chartH;
    if (!has)        tft.drawFastHLine(x, CHART_BOT, CHART_BARW - 1, UI_CARD);
    else if (h <= 1) tft.drawFastHLine(x, CHART_BOT, CHART_BARW - 1, COLOR_RED);
    else             tft.fillRect(x, CHART_BOT - h, CHART_BARW - 1, h, live ? THEME_PINK : THEME_CYAN);
  }

  if (targetRateHr > 0) {                       // เส้นเป้าหมาย
    int ty = CHART_BOT - (int)((targetRateHr / trendScale) * chartH);
    if (ty < CHART_TOP) ty = CHART_TOP;
    for (int x = CHART_X; x < CHART_X + chartW; x += 6) tft.drawFastHLine(x, ty, 3, COLOR_YELLOW);
  }

  tft.drawFastHLine(CHART_X - 2, CHART_BOT + 1, chartW + 4, UI_LINE);
  textAt(padTo(String((int)trendScale) + " mL/h", 10), CHART_X, CHART_TOP - 12, 1, UI_DIM, THEME_BG);
  textAt("-30m", CHART_X, CHART_BOT + 6, 1, UI_DIM, THEME_BG);
  textRight("now", CHART_X + chartW, CHART_BOT + 6, 1, UI_DIM, THEME_BG);
  trendNeedsRedraw = false;
}

void drawTrendLiveBar() {
  if (trendLive > trendScale) { drawTrendChart(); return; }
  const int chartH = CHART_BOT - CHART_TOP;
  int x = CHART_X + (TREND_BARS - 1) * CHART_BARW;
  int h = (int)((trendLive / trendScale) * chartH);
  if (h > chartH) h = chartH;
  tft.fillRect(x, CHART_TOP, CHART_BARW - 1, chartH, THEME_BG);
  if (targetRateHr > 0) {                       // คืนเส้นเป้าหมายในช่วงที่ลบไป
    int ty = CHART_BOT - (int)((targetRateHr / trendScale) * chartH);
    if (ty >= CHART_TOP && ty <= CHART_BOT) tft.drawFastHLine(x, ty, CHART_BARW - 1, COLOR_YELLOW);
  }
  if (h <= 1) tft.drawFastHLine(x, CHART_BOT, CHART_BARW - 1, COLOR_RED);
  else        tft.fillRect(x, CHART_BOT - h, CHART_BARW - 1, h, THEME_PINK);
}

void drawPage4Framework() {
  tft.fillScreen(THEME_BG);
  drawTopBar(true);
  textAt("FLOW TREND", 12, 32, 1, UI_DIM, THEME_BG);
  textRight(padTo(targetRateHr > 0 ? ("TARGET " + String((int)(targetRateHr + 0.5f))) : String("TARGET --"), 10),
            164, 32, 1, COLOR_YELLOW, THEME_BG);
  tft.fillRoundRect(6, 216, 160, 54, 6, UI_CARD);
  textAt("NOW", 14, 222, 1, UI_DIM, UI_CARD);
  textAt("AVG 30m", 100, 222, 1, UI_DIM, UI_CARD);
  drawTrendChart();
  drawPageDots(3, 308);
  cacheP4 = "";
  stateNeedsRedraw = false;
}

void updatePage4Dynamic() {
  drawTopBar(false);

  float sum = 0.0f;
  int cnt = 0;
  for (int i = 1; i < TREND_BARS; i++) {
    if (!trendValidAt(i)) continue;
    sum += trendValueAt(i);
    cnt++;
  }
  int avg = (cnt > 0) ? (int)(sum / cnt + 0.5f) : -1;
  int now = isRunning ? (int)(currentFlowRate_ml_hr + 0.5f) : -1;

  String key = String(now) + ":" + String(avg);
  if (key != cacheP4) {
    cacheP4 = key;
    textAt(padTo(now >= 0 ? String(now) : String("--"), 4), 14, 234, 3, COLOR_WHITE, UI_CARD);
    textAt(padTo(avg >= 0 ? String(avg) : String("--"), 4), 100, 238, 2, THEME_CYAN, UI_CARD);
  }
  if (trendNeedsRedraw) drawTrendChart();
  else                  drawTrendLiveBar();
}

// ============================================================================
// เก็บข้อมูลกราฟแนวโน้ม (ทำงานตลอดเวลา ไม่ว่าจะเปิดหน้าไหนอยู่)
// ============================================================================
void resetTrendData() {
  for (int i = 0; i < TREND_BARS; i++) { trendBin[i] = 0.0f; trendHas[i] = false; }
  trendHead = 0;
  trendSum = 0.0f;
  trendSamples = 0;
  trendLive = 0.0f;
  trendBinStart = millis();
  trendNeedsRedraw = true;
}

void updateTrendAccumulator(unsigned long now) {
  if (now - trendLastSample >= 1000) {
    trendLastSample = now;
    trendSum += isRunning ? currentFlowRate_ml_hr : 0.0f;
    trendSamples++;
    trendLive = (trendSamples > 0) ? (trendSum / trendSamples) : 0.0f;
  }
  if (now - trendBinStart >= TREND_BIN_MS) {
    trendBinStart = now;
    trendBin[trendHead] = (trendSamples > 0) ? (trendSum / trendSamples) : 0.0f;
    trendHas[trendHead] = true;
    trendHead = (trendHead + 1) % TREND_BARS;
    trendSum = 0.0f;
    trendSamples = 0;
    trendLive = 0.0f;
    trendNeedsRedraw = true;
  }
}

// ============================================================================
// จอเตือนเหตุวิกฤต (เต็มจอสีแดง)
// ============================================================================
void drawEmergencyScreen(uint8_t code) {
  tft.fillScreen(COLOR_RED);
  tft.fillRoundRect(12, 12, 148, 32, 6, COLOR_WHITE);
  char bed[12];
  snprintf(bed, sizeof(bed), "BED %02d", currentStationId);
  drawCenteredString(String(bed), 20, 2, COLOR_RED, COLOR_WHITE);

  const char* headline = "ALERT";
  const char* sub      = "CHECK IV SYSTEM";
  if (code == ALERT_OCCLUSION)      { headline = "NO FLOW";  sub = "CHECK IV LINE"; }
  else if (code == ALERT_TOO_FAST)  { headline = "TOO FAST"; sub = "ADJUST ROLLER CLAMP"; }
  else if (code == ALERT_TOO_SLOW)  { headline = "TOO SLOW"; sub = "ADJUST ROLLER CLAMP"; }
  else if (code == ALERT_COMPLETE)  { headline = "COMPLETE"; sub = "INFUSION FINISHED"; }

  drawCenteredString(String(headline), 62, 3, COLOR_WHITE, COLOR_RED);
  drawCenteredString(String(sub), 96, 1, COLOR_YELLOW, COLOR_RED);

  tft.fillRoundRect(12, 118, 148, 100, 8, THEME_BG);
  textAt("RATE", 22, 126, 1, UI_DIM, THEME_BG);
  textAt("mL/h", 22, 186, 1, UI_DIM, THEME_BG);
  textRight(targetRateHr > 0 ? ("SET " + String((int)(targetRateHr + 0.5f))) : String("SET --"),
            150, 186, 1, THEME_SKYBLUE, THEME_BG);

  tft.fillRoundRect(14, 230, 144, 62, 8, COLOR_WHITE);
  drawCenteredString("CLICK = SNOOZE 2min", 244, 1, COLOR_RED, COLOR_WHITE);
  drawCenteredString("DOUBLE = PAUSE", 268, 1, COLOR_RED, COLOR_WHITE);

