kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_7_1/ESP32-S3-Station-V_7_7_1.ino
  lastEmergencyCode = code;
  cacheRate = -9999;
  stateNeedsRedraw = false;
}

void updateEmergencyDynamic() {
  int rate = (int)(currentFlowRate_ml_hr + 0.5f);
  if (rate == cacheRate) return;
  cacheRate = rate;
  tft.fillRect(20, 140, 132, 40, THEME_BG);
  textAt(String(rate), 22, 142, 5, COLOR_WHITE, THEME_BG);
}

// ============================================================================
// จอเตือนใกล้หมดถุง (สีส้ม ไม่ใช่เหตุวิกฤต)
// ============================================================================
void drawNearEndNoticeFramework() {
  tft.fillScreen(COLOR_ORANGE);
  tft.fillRoundRect(12, 12, 148, 32, 6, COLOR_WHITE);
  char bed[12];
  snprintf(bed, sizeof(bed), "BED %02d", currentStationId);
  drawCenteredString(String(bed), 20, 2, COLOR_ORANGE, COLOR_WHITE);

  drawCenteredString("NEXT BAG", 60, 3, THEME_BG, COLOR_ORANGE);
  drawCenteredString("PREPARE NEW IV BAG", 94, 1, THEME_BG, COLOR_ORANGE);

  tft.fillRoundRect(12, 114, 148, 104, 8, THEME_BG);
  tft.fillRoundRect(14, 236, 144, 58, 8, COLOR_WHITE);
  drawCenteredString("CLICK = OK", 248, 2, COLOR_ORANGE, COLOR_WHITE);
  drawCenteredString("(stop reminder)", 274, 1, THEME_BG, COLOR_WHITE);

  cacheNear = "";
  stateNeedsRedraw = false;
}

void updateNearEndNoticeDynamic() {
  int pct = infusedPct();
  int left = remainingMlInt();
  String end = endClockText();
  String key = String(pct) + ":" + String(left) + ":" + end;
  if (key == cacheNear) return;
  cacheNear = key;

  textCenterIn(padTo("INFUSED " + String(pct < 0 ? 0 : pct) + "%", 12), 12, 148, 126, 2, COLOR_WHITE, THEME_BG);
  textCenterIn(padTo(String(left) + " mL LEFT", 12), 12, 148, 152, 2, COLOR_ORANGE, THEME_BG);
  textCenterIn(padTo("EMPTY AT " + end, 18), 12, 148, 180, 1, COLOR_YELLOW, THEME_BG);
  drawProgressBar(26, 196, 120, 10, (pct < 0) ? 0 : pct, COLOR_ORANGE);
}

// ============================================================================
// Screensaver — เห็นเฉพาะสิ่งที่ต้องดูจากระยะไกล
// ============================================================================
void drawScreensaverFramework() {
  tft.fillScreen(THEME_BG);
  UiStatus st = uiStatusOf(uiAlertCode);
  char bed[12];
  snprintf(bed, sizeof(bed), "BED %02d", currentStationId);
  tft.fillRoundRect(46, 20, 80, 28, 6, uiStatusColor(st));
  textCenterIn(String(bed), 46, 80, 26, 2, THEME_BG, uiStatusColor(st));
  drawCenteredString("mL/h", 232, 1, UI_DIM, THEME_BG);
  drawCenteredString("CLICK TO WAKE", 296, 1, UI_DIM, THEME_BG);
  cacheClock = ""; cacheRate = -9999; cacheStatusWord = "";
  stateNeedsRedraw = false;
}

void updateScreensaverDynamic() {
  String clockStr = getStationClockStr();
  if (clockStr != cacheClock) {
    cacheClock = clockStr;
    drawCenteredString(clockStr, 76, 5, COLOR_WHITE, THEME_BG);
  }

  UiStatus st = uiStatusOf(uiAlertCode);
  String word = String(uiStatusWord(st));
  if (word != cacheStatusWord) {
    cacheStatusWord = word;
    tft.fillRect(6, 136, 160, 20, THEME_BG);
    drawCenteredString(word, 138, 2, uiStatusColor(st), THEME_BG);
  }

  int rate = isRunning ? (int)(currentFlowRate_ml_hr + 0.5f) : -1;
  if (rate != cacheRate) {
    cacheRate = rate;
    tft.fillRect(6, 180, 160, 44, THEME_BG);
    drawCenteredString(rate >= 0 ? String(rate) : String("--"), 182, 5,
                       (st == UI_NOFLOW) ? COLOR_RED : COLOR_WHITE, THEME_BG);
  }
}

// ============================================================================
// หน้าผู้พัฒนา / หน้าตั้งหมายเลขเตียง
// ============================================================================
void drawDeveloperCreditScreen() {
  tft.fillScreen(THEME_BG);
  tft.fillRoundRect(6, 16, 160, 34, 6, THEME_PINK);
  drawCenteredString("SMART IV ALERT", 26, 2, THEME_BG, THEME_PINK);

  drawCenteredString("Bed Station Node", 66, 1, UI_DIM, THEME_BG);
  drawCenteredString("FW v" APP_VERSION, 82, 1, THEME_SKYBLUE, THEME_BG);

  tft.fillRoundRect(6, 106, 160, 96, 8, UI_CARD);
  drawCenteredString("DEVELOPER", 114, 1, UI_DIM, UI_CARD);
  drawCenteredString("Kittiphan", 132, 2, COLOR_YELLOW, UI_CARD);
  drawCenteredString("Rattanakorn", 154, 2, COLOR_YELLOW, UI_CARD);
  drawCenteredString("MCU Phrae Campus", 180, 1, UI_DIM, UI_CARD);

  tft.fillRoundRect(6, 212, 160, 60, 8, UI_CARD);
  drawCenteredString("BCN Phrae Innovation", 224, 1, THEME_CYAN, UI_CARD);
  drawCenteredString("Suk Mean Hospital Trial", 244, 1, UI_DIM, UI_CARD);

  drawCenteredString("CLICK TO RETURN", 296, 1, UI_DIM, THEME_BG);
  stateNeedsRedraw = false;
}

// ----------------------------------------------------------------------------
// ทิศการแสดงผลของจอ
// ----------------------------------------------------------------------------
// setRotation(0) กับ (2) เป็นแนวตั้ง 172x320 เหมือนกัน ต่างกันแค่บิต MX/MY ใน
// MADCTL พิกัดที่ใช้วาดทั้งไฟล์จึงไม่ต้องแก้ เพียงสั่งวาดหน้าเดิมซ้ำอีกครั้ง
void applyScreenRotation(uint8_t rot) {
  screenRotation = (rot == TFT_ROT_FLIP180) ? TFT_ROT_FLIP180 : TFT_ROT_NORMAL;
  tft.setRotation(screenRotation);
  tft.setTextWrap(false);
  tft.fillScreen(THEME_BG);
  stateNeedsRedraw = true;      // ให้ทุกหน้าวาดกรอบใหม่ทั้งหน้า (แคชถูกล้างในนั้น)
}

void saveScreenRotation() {
  stationPrefs.begin("st_cfg", false);
  stationPrefs.putUChar("rot", screenRotation);
  stationPrefs.end();
}

const char *screenRotationLabel() {
  return (screenRotation == TFT_ROT_FLIP180) ? "FLIP 180" : "NORMAL";
}

void drawStationIdConfigFramework() {
  tft.fillScreen(THEME_BG);
  tft.fillRoundRect(6, 16, 160, 34, 6, THEME_SKYBLUE);
  drawCenteredString("SET BED ID", 26, 2, THEME_BG, THEME_SKYBLUE);
  tft.fillRoundRect(6, 62, 160, 150, 8, UI_CARD);

  // แถวตั้งค่าทิศจอ — ช่วยให้ติดตั้งกล่องได้ทั้งแบบสาย USB ลงล่างและขึ้นบน
  tft.fillRoundRect(6, 220, 160, 42, 8, UI_CARD);
  drawCenteredString("SCREEN", 226, 1, UI_DIM, UI_CARD);
  drawCenteredString(padTo(screenRotationLabel(), 10), 240, 2, THEME_CYAN, UI_CARD);

  drawCenteredString("CLICK = BED 1-8", 272, 1, UI_DIM, THEME_BG);
  drawCenteredString("DBL CLICK = FLIP", 284, 1, UI_DIM, THEME_BG);
  cacheConfig = "";
  stateNeedsRedraw = false;
}

